---
kind: method
id: M:Autodesk.Revit.DB.MullionTypeSet.Insert(Autodesk.Revit.DB.MullionType)
source: html/64e1e508-e093-7610-1828-ae29909a578a.htm
---
# Autodesk.Revit.DB.MullionTypeSet.Insert Method

Insert the specified mullion type into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	MullionType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.MullionType`) - The mullion type to be inserted into the set.

## Returns
Returns whether the mullion type was inserted into the set.